# SetPoints Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
LineLoad..::..SetPoints Method
LineLoad Class See Also
---
Sets start and end point of the line load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool SetPoints(
	XYZ startPoint,
	XYZ endPoint
)
```

Visual Basic
---
```text
Public Function SetPoints ( _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
bool SetPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
```

# ### Parameters
startPoint
    Type: Autodesk.Revit.DB..::..XYZ The start point.
endPoint
    Type: Autodesk.Revit.DB..::..XYZ The end point.
# ### Return Value
Returns true if successful, false otherwise.
# Remarks
This method works with non hosted line load only.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the end point is equal to the start point. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace